[
    {
        "id": "1",
        "title": "The Language of Earth",
        "theme": "bedrock",
        "content": "In the early morning light of the Maloti Mountains, as mist rises from the valleys and the first rays of sun touch the peaks that give Lesotho its name as the \"Kingdom in the Sky,\" something extraordinary becomes visible across the landscape. Scattered throughout the villages that dot these highlands, the walls of traditional homes come alive with intricate geometric patterns that seem to pulse with their own inner rhythm. These are not mere decorations, but expressions of a sophisticated artistic tradition that has transformed the humble materials of earth and dung into vehicles for beauty, meaning, and cultural continuity.\n\nThis is Litema—pronounced \"di-te-ma\" in the musical cadences of Sesotho—an art form that embodies the profound connection between the Basotho people and their environment, between women and their creative power, and between the practical necessities of daily life and the human need for beauty and meaning. To understand Litema is to enter into a world where art and life are inseparable, where the walls of a home become canvases for expressing everything from agricultural cycles to spiritual beliefs, from personal identity to community belonging."
    },
    {
        "id": "2",
        "title": "Roots in the Earth",
        "theme": "history",
        "content": "The story of Litema stretches back through centuries of Basotho history, its roots extending deep into the cultural soil of Southern Africa... (Content truncated for prototype)"
    },
    {
        "id": "3",
        "title": "Sacred Geometry",
        "theme": "engine",
        "content": "In the intricate geometric patterns that flow across the walls of Basotho homes lies a sophisticated language of meaning... (Content truncated for prototype)"
    },
    {
        "id": "4",
        "title": "Hands That Create",
        "theme": "process",
        "content": "In the quiet hours of early morning, when the mountain air is crisp... (Content truncated for prototype)"
    },
    {
        "id": "5",
        "title": "Living Tradition",
        "theme": "adaptation",
        "content": "In the digital galleries of social media platforms... (Content truncated for prototype)"
    },
    {
        "id": "6",
        "title": "Future Patterns",
        "theme": "future",
        "content": "As the sun sets over the Maloti Mountains... (Content truncated for prototype)"
    }
]